Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ПроведениеСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеСобеседования</name>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>ТипСобеседования</name>
    <type>
      <types>EnumRef.ТипыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСобеседования</name>
    <type>
      <types>EnumRef.РезультатыСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеЛицаЗаСобеседование</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/КоличествоКандидатовПоЭтапам/КоличествоКандидатовПоЭтапам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоКандидатовПоЭтапам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/Enums/ТипыСобеседований/ТипыСобеседований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСобеседований</name>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Enums/ЭтапыПодбора/ЭтапыПодбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПодбора</name>
  <enumValues>
    <name>Неразобранные</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрРезюме</name>
  </enumValues>
  <enumValues>
    <name>ТелефонноеИнтервью</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПринялПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказалсяОтПредложения</name>
  </enumValues>
  <enumValues>
    <name>ОтказКандидату</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ТипСобеседования = Перечисления.ТипыСобеседований.ПервичноеСобеседование Тогда
		ЗаписатьРезультатПервичногоСобеседованияВРегистр();
	ИначеЕсли ТипСобеседования = Перечисления.ТипыСобеседований.СобеседованиеСИнициатором Тогда
		ЗаписатьРезультатСобеседованияСИнициаторомВРегистр();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьРезультатПервичногоСобеседованияВРегистр()

	// регистр КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ТелефонноеИнтервью;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
КонецПроцедуры

Процедура ЗаписатьРезультатСобеседованияСИнициаторомВРегистр()

	// регистр КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.СобеседованиеСИнициатором;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;
	
	// регистр КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ПервичноеСобеседование;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;	

КонецПроцедуры
